tommyys/obdgauge/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
# 8MB embedded PSRAM, octal (esptool reports "Embedded PSRAM 8MB (AP_3v3)").
# Needed for the 466x466 framebuffer: ~424KB per frame.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# This board has no USB-to-UART bridge: the only link to the Mac is the
# ESP32-S3's native USB-Serial/JTAG. IDF defaults the console to UART0, whose
# pins go nowhere here, so printf output is invisible without this.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_CXX_EXCEPTIONS=n

# Fonts for the gauge readouts. LVGL ships none enabled by default beyond 14.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# The backdrop benchmark deliberately spins without yielding; the idle-task
# watchdog otherwise fires once per measurement window and pollutes the timings.
CONFIG_ESP_TASK_WDT_INIT=n

# Real FPS from the display pipeline, so frame-rate questions are answered with
# a number rather than an opinion. Costs <2us per frame.
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FPS_STATS=y

# LVGL will not refresh more often than this, so the default 33ms pinned the UI
# at 30fps regardless of how cheap frames became.
CONFIG_LV_DEF_REFR_PERIOD=16
